** Building
   :PROPERTIES:
   :date:     2015/12/11 14:47:59
   :updated:  2015/12/11 14:48:26
   :END:

At the moment, you have to add a hook function to put the replacements in the document before parsing.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path ".")
(require 'org-ref-citeproc)

(when (file-exists-p "readme.html") (delete-file "readme.html"))
(let ((org-export-before-parsing-hook '(orcp-citeproc)))
  (browse-url (org-html-export-to-html)))
#+End_src

#+RESULTS:
: #<process open ./readme-unsrt.html>


